Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.NameKey
Name Key
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.CentroidVertical
Distance from centroid to the upper extremites along vertical axis.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.CentroidHorizontal
Distance from centroid to the left extremites along horizontal axis.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.Height
Section height, depth.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.Width
Section width.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
Defines common set of parameters for structural section rectangular contour.
Since:
2015